import React from "react";
import B2BHajjUmrahLayout from "../../../../../components/UmrahHajj/Umrah/B2BHajjUmrahLayout";
import umrah from "../../../../../public/assets/umra8.jpg";
import style from "../umrah-visa-requirement/requirement.module.css";
import Image from "next/image";

const Benefit = () => {
  return (
    <section>
      <B2BHajjUmrahLayout>
        <div className={style.visaRequirment}>
          <div className={style.visaRequirmentImg}>
            <Image loading="lazy" className={style.requireImg} alt="requirement" src={umrah} />
          </div>

          <div className="mt-5">
            <h3 className="text-3xl font-bold">
              রমজানে ওমরা করলে হজ করার সওয়াব
            </h3>
            <p>
              পবিত্র কোরআনুল কারিমে আল্লাহ তায়ালা বলেন, ‘এ সেই রমজান, যে মাসে
              মানবের হেদায়েতের জন্য কোরআন অবতীর্ণ করা হয়েছে।’ (সূরা বাকারা :
              ১৮৫)।
            </p>
            <p>
              এ মাসের সিয়ামকে আল্লাহ তায়ালা ফরজ করে বলেন, ‘সুতরাং তোমাদের মধ্যে
              যে ব্যক্তি এ মাস পাবে সে যেন সিয়াম পালন করে।’ (সূরা বাকারা : ১৮৫)।
              হজরত তালহা বিন উবাইদুল্লাহ বলেন, এক ব্যক্তি নবী (সা.)কে জিজ্ঞেস
              করল, হে আল্লাহর রাসুল! আমার ওপর আল্লাহ কী কী রোজা ফরজ করেছেন, তা
              আমাকে বলে দিন। উত্তরে তিনি বললেন, ‘রমজানের রোজা।’ লোকটি বলল, এছাড়া
              অন্য কিছু কি আমার কর্তব্য আছে? তিনি বললেন, না, তবে যদি তুমি নফল
              রোজা রাখ, তা হলে ভিন্ন কথা।’ (বোখারি : ১৮৯১)। অন্য এক বর্ণনায়
              এসেছে, নবী করিম (সা.) এরশাদ করেন, আল্লাহ তায়ালা তোমাদের জন্য এ
              মাসের সিয়াম পালন ফরজ করেছেন। (নাসাঈ)।
            </p>
            <p>
              ফলে ফরজ সিয়াম রমজানে হওয়ার কারণে এ মাসের মর্যাদা আরও বেড়ে গেছে। এ
              মাস এলে রাসুলে করিম (সা.) অতিশয় আনন্দিত হয়ে সাহাবাদের সুসংবাদ দিয়ে
              বলতেন, তোমাদের দ্বারে বরকতময় মাস রমজান এসেছে। (নাসাঈ)।
            </p>
            <p>
              রাসুলুল্লাহ (সা.) বলেন, যে ব্যক্তি আল্লাহ ও তাঁর রাসুলের প্রতি
              ঈমান আনল, সালাত কায়েম করল, জাকাত আদায় করল, রমজানে সিয়াম পালন করল,
              তার জন্য আল্লাহর হুকুম হল তাকে জান্নাতে প্রবেশ করিয়ে দেয়া।
              (বোখারি)।
            </p>

            <p>
              রাসুলুল্লাহ (সা.) বলেন, রমজানে প্রত্যেক মোমিন মুসলিমের দোয়া কবুল
              করা হয়। (বাযযার, সহি আত-তারগিব ওয়াত-তারহিব : ৯৮৮, মুসনাদে আহমাদ :
              ৭৪৫০)। এ মাসের প্রতি রাত ও দিনে আল্লাহ রাব্বুল আলামিন বহু মানুষকে
              দোজখ থেকে মুক্তি দিয়ে থাকেন, রাসুলুল্লাহ (সা.) বলেন, আল্লাহ
              রাব্বুল আলামিন রমজানের প্রতি রাতে ও দিনে বহু মানুষকে জাহান্নাম
              থেকে মুক্তি দিয়ে থাকেন। (আত-তারগিব ওয়াত-তারহিব, মুসনাদে আহমাদ :
              ৭৪৫০)।
            </p>

            <p>
              এ মাসে সৎকর্মের প্রতিদান বহু গুণে বাড়িয়ে দেয়া হয়। যেমন- হাদিসে
              এসেছে, রমজানে ওমরা করলে একটি হজের সওয়াব পাওয়া যায়। শুধু তাই নয়,
              বরং, রমজানে ওমরা করা আল্লাহর রাসুলের সঙ্গে হজ আদায়ের মর্যাদা রাখে।
              এমনিভাবে সব ইবাদত-বন্দেগিসহ সব সৎ কাজের প্রতিদান কয়েক গুণ বেড়ে
              যায়।
            </p>
            <p>
              এ মাসে আমলের মাধ্যমে অনেক বেশি মুনাফা লাভ করা যায়। এ প্রসঙ্গে
              হাদিসে বর্ণিত হয়েছে, হজরত আবদুল্লাহ ইবন আব্বাস (রা.) বলেন,
              রাসুলুল্লাহ (সা.) এক আনসারি মহিলাকে বললেন, তুমি কেন আমাদের সঙ্গে
              হজ করতে যাওনি? তিনি বললেন, আমাদের পানি বহনকারী দুটি মাত্র উট
              রয়েছে। একটিতে আমার ছেলের বাবা (স্বামী) ও তার ছেলে হজ করতে গিয়েছেন,
              অন্যটি পানি বহনের জন্য আমাদের কাছে রেখে গিয়েছেন। তিনি বলেন, রমজান
              এলে তুমি ওমরা করবে। কেননা এ মাসের ওমরা একটি হজের তুল্য। সহিহ
              মুসলিমের অন্য বর্ণনায় আছে, রাসুলুল্লাহ (সা.) এরশাদ করেছেন, রমজানে
              ওমরা একটি হজের তুল্য। (বোখারি : ১৭৮২, মুসলিম : ১২৫৬, মুসনাদে আহমাদ
              : ২০২৫)।
            </p>

            <p>
              অন্য বর্ণনায় রয়েছে, উম্মে মাকিল (রা.) বলেন, ইয়া রাসুলুল্লাহ! আমি
              তো হজ করতে ইচ্ছুক। কিন্তু আমার উটটি দুর্বল। তিনি বললেন, তুমি
              রমজানে ওমরা করো। কেননা রমজানে ওমরা (সওয়াব হিসেবে) হজের তুল্য।
              (মুসনাদে আহমাদ : ২৭২৮৫)। হে আল্লাহ আমাদের রমজানে ওমরা করার তৌফিক
              দান করুন।
            </p>
          </div>
        </div>
        
      </B2BHajjUmrahLayout>
    </section>
  );
};

export default Benefit;
